loadtest/webhook-event.yml
config:
  target: http://127.0.0.1:3000
  http:
    # Set a max of five TCP connections per virtual user.
    maxSockets: 5
    pool: 100
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 20
      name: Warm up phase
    - duration: 20
      arrivalRate: 20
      rampTo: 80
      name: Ramp up load
    - duration: 60
      arrivalRate: 100
      name: Spike phase
  payload:
      path: "lineWebhook.testdata.100000.csv"
      fields:
        - "webhookEventId"
        - "userId"
        - "timestamp"
        - "replyToken"
        - "message.id"
        - "message.text"
        - "webhookEventId2"
        - "userId2"
        - "timestamp2"
        - "replyToken2"
        - "message2.id"
        - "message2.text"
      order: sequence
      skipHeader: true
  environments:
    small:
      target: http://127.0.0.1:3000
    phases:
    - duration: 2
      arrivalRate: 2
      name: small load

scenarios:
  - name: "follow event"
    weight: 16
    flow:
      - post:
          url: "/webhook-event"
          headers:
            x-line-signature: 6buSbrlRRm9OseSr4we6MFiDvlvrbKIwIJz6hTtlLME=
          json:
            destination: xxxxxxxxxx
            events:
            - type: follow
              timestamp: {{timestamp}}
              source:
                type: user
                userId: {{userId}}
              replyToken: {{replyToken}}
              mode: active
              webhookEventId: {{webhookEventId}}
              deliveryContext:
                isRedelivery: false
            - type: follow
              timestamp: {{timestamp2}}
              source:
                type: user
                userId: {{userId2}}
              replyToken: {{replyToken2}}
              mode: active
              webhookEventId: {{webhookEventId2}}
              deliveryContext:
                isRedelivery: false
  - name: "message event"
    weight: 76
    flow:
      - post:
          url: "/webhook-event"
          headers:
            x-line-signature: 6buSbrlRRm9OseSr4we6MFiDvlvrbKIwIJz6hTtlLME=
          json:
            destination: xxxxxxxxxx
            events:
            - type: message
              message:
                type: text
                id: {{message.id}}
                text: {{message.text}}
              timestamp: {{timestamp}}
              source:
                type: user
                userId: {{userId}}
              replyToken: {{replyToken}}
              mode: active
              webhookEventId: {{webhookEventId}}
              deliveryContext:
                isRedelivery: false
            - type: message
              message:
                type: text
                id: {{message2.id}}
                text: {{message2.text}}
              timestamp: {{timestamp2}}
              source:
                type: user
                userId: {{userId2}}
              replyToken: {{replyToken}}
              mode: active
              webhookEventId: {{webhookEventId2}}
              deliveryContext:
                isRedelivery: false
  - name: "unfollow event"
    weight: 8
    flow:
      - post:
          url: "/webhook-event"
          headers:
            x-line-signature: 6buSbrlRRm9OseSr4we6MFiDvlvrbKIwIJz6hTtlLME=
          json:
            destination: xxxxxxxxxx
            events:
            - type: unfollow
              timestamp: {{timestamp}}
              source:
                type: user
                userId: {{userId}}
              mode: active
              webhookEventId: {{webhookEventId}}
              deliveryContext:
                isRedelivery: false